# Future Sales Prediction

###  importing neccesary libraries

In [12]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import time

In [13]:
sales_train = pd.read_csv('C:/Users/user/Desktop/kaggle competetion/predict future sales/sales_train.csv')
item_categories = pd.read_csv('C:/Users/user/Desktop/kaggle competetion/predict future sales/item_categories.csv')
test = pd.read_csv('C:/Users/user/Desktop/kaggle competetion/predict future sales/test.csv')
items = pd.read_csv("C:/Users/user/Desktop/kaggle competetion/predict future sales/items.csv")
shops = pd.read_csv('C:/Users/user/Desktop/kaggle competetion/predict future sales/shops.csv')
    #sample_submission = pd.read_csv('C:/Users/user/Desktop/kaggle competetion/predict future sales/sample_submission.csv')

In [16]:
sales_train.head()

         date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0  02.01.2013               0       59    22154      999.00           1.0
1  03.01.2013               0       25     2552      899.00           1.0
2  05.01.2013               0       25     2552      899.00          -1.0
3  06.01.2013               0       25     2554     1709.05           1.0
4  15.01.2013               0       25     2555     1099.00           1.0

In [17]:
item_categories.head()

           item_category_name  item_category_id
0  PC - Headsets / Headphones                 0
1           Accessories - PS2                 1
2           Accessories - PS3                 2
3           Accessories - PS4                 3
4           Accessories - PSP                 4

In [18]:
test.head()

   ID  shop_id  item_id
0   0        5     5037
1   1        5     5320
2   2        5     5233
3   3        5     5232
4   4        5     5268

In [19]:
items.head()

,item_name,item_id,item_category_id
0,! POWER IN glamor (PLAST.) D,0,40
1,! ABBYY FineReader 12 Professional Edition Ful...,1,76
2,*** In the glory (UNV) D,2,40
3,*** BLUE WAVE (Univ) D,3,40
4,*** BOX (GLASS) D,4,40

In [20]:
shops.head()

                           shop_name  shop_id
0  ! Yakutsk Ordzhonikidze, 56 Franc        0
1       ! Yakutsk TC "Central" Franc        1
2                   Adygea TC "Mega"        2
3   Balashikha TRC "October-Kinomir"        3
4         Volzhsky mall "Volga Mall"        4

date              0
date_block_num    0
shop_id           0
item_id           0
item_price        0
item_cnt_day      0
dtype: int64